20220412130836-job_descirption_for_deep_learning_engineer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Job Descirption for Deep Learning Engineer</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Job Descirption for Deep Learning Engineer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74fe27f">Requirement</a>
<ul>
<li><a href="#orga8517a7">theory</a>
<ul>
<li><a href="#orgac67161">Machine Learning</a></li>
<li><a href="#org7d07601">Deep Learning</a></li>
</ul>
</li>
<li><a href="#org6ee0648">skills</a>
<ul>
<li><a href="#orgb332977">programming technique</a></li>
<li><a href="#org3af61f9">documentation</a></li>
<li><a href="#orgb69848d">Linux</a></li>
<li><a href="#org8128d51">Office</a></li>
</ul>
</li>
<li><a href="#org1e1b105">experience</a>
<ul>
<li><a href="#orgce410d7">coding example</a></li>
<li><a href="#org0801372">documentation example</a></li>
<li><a href="#org83cc290">Github/Gitlab</a></li>
<li><a href="#org7e0a728">MLOps</a></li>
<li><a href="#orgbe42e9d">Git-Flow</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       47ed36d4-97cc-4912-9c21-ca27b9a2ddc0
</p>
<p>
<a href="./20231024174436-deep_learning_theory.html">deep learning theory</a>
</p>

<div id="outline-container-org74fe27f" class="outline-2">
<h2 id="org74fe27f">Requirement</h2>
<div class="outline-text-2" id="text-org74fe27f">
</div>
<div id="outline-container-orga8517a7" class="outline-3">
<h3 id="orga8517a7">theory</h3>
<div class="outline-text-3" id="text-orga8517a7">
</div>
<div id="outline-container-orgac67161" class="outline-4">
<h4 id="orgac67161">Machine Learning</h4>
</div>
<div id="outline-container-org7d07601" class="outline-4">
<h4 id="org7d07601">Deep Learning</h4>
<div class="outline-text-4" id="text-org7d07601">
</div>
<ul class="org-ul">
<li><a id="org3d7540c"></a>Deep Reinforcement Learning<br /></li>
<li><a id="org22849e3"></a>GAN/VAE<br /></li>
<li><a id="orgb503b27"></a>GNN<br /></li>
<li><a id="org6cde311"></a>RNN/LSTM/Transformer<br /></li>
<li><a id="orgc83617a"></a>NERF<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6ee0648" class="outline-3">
<h3 id="org6ee0648">skills</h3>
<div class="outline-text-3" id="text-org6ee0648">
</div>
<div id="outline-container-orgb332977" class="outline-4">
<h4 id="orgb332977">programming technique</h4>
<div class="outline-text-4" id="text-orgb332977">
</div>
<ul class="org-ul">
<li><a id="org547ea79"></a>python: iter, exception handling, function decorator<br /></li>
<li><a id="orgab04ad5"></a>tensorflow/pytorch<br /></li>
<li><a id="orge4cfc01"></a>ml<sub>collections</sub>/fiddle/pyrallis/hydra (lazy computation)<br /></li>
<li><a id="orgb596ba4"></a>argparse, abseil-py, getopt(), optparse, &#x2026;<br /></li>
<li><a id="orgeb98fb1"></a>pandas, numpy, scipy, scikit-learn,<br /></li>
<li><a id="orgc17f598"></a>unittest/nose<br /></li>
<li><a id="orgfa146de"></a>Jupyter Notebook/JupterLab<br /></li>
</ul>
</div>
<div id="outline-container-org3af61f9" class="outline-4">
<h4 id="org3af61f9">documentation</h4>
<div class="outline-text-4" id="text-org3af61f9">
</div>
<ul class="org-ul">
<li><a id="org745aff0"></a>markdown<br /></li>
<li><a id="orge90ce67"></a>rST (reStructuredText)<br /></li>
<li><a id="orgdc95412"></a>orgmode<br /></li>
<li><a id="orgd5399e2"></a>asciidoc<br /></li>
<li><a id="orgaca404a"></a>texinfo<br /></li>
<li><a id="orgaf98903"></a>doxygen<br /></li>
<li><a id="orged8d45f"></a>json: data type<br /></li>
</ul>
</div>
<div id="outline-container-orgb69848d" class="outline-4">
<h4 id="orgb69848d">Linux</h4>
<div class="outline-text-4" id="text-orgb69848d">
</div>
<ul class="org-ul">
<li><a id="orga8226c9"></a>script<br /></li>
<li><a id="org3de08dd"></a>git: commit, push, branch, merge, rebase, lfs, pull request/merge request;<br /></li>
<li><a id="orgf2f4bc5"></a>emacs/vim<br /></li>
<li><a id="org5b81b38"></a>docker<br /></li>
</ul>
</div>
<div id="outline-container-org8128d51" class="outline-4">
<h4 id="org8128d51">Office</h4>
<div class="outline-text-4" id="text-org8128d51">
</div>
<ul class="org-ul">
<li><a id="orgfb9baea"></a>markdown: pandoc, reveal.js etc.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org1e1b105" class="outline-3">
<h3 id="org1e1b105">experience</h3>
<div class="outline-text-3" id="text-org1e1b105">
</div>
<div id="outline-container-orgce410d7" class="outline-4">
<h4 id="orgce410d7">coding example</h4>
</div>
<div id="outline-container-org0801372" class="outline-4">
<h4 id="org0801372">documentation example</h4>
</div>
<div id="outline-container-org83cc290" class="outline-4">
<h4 id="org83cc290">Github/Gitlab</h4>
</div>
<div id="outline-container-org7e0a728" class="outline-4">
<h4 id="org7e0a728">MLOps</h4>
</div>
<div id="outline-container-orgbe42e9d" class="outline-4">
<h4 id="orgbe42e9d">Git-Flow</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
